{
  "HomePage": {
    "title": "Hello world!",
    "about": "Go to the about page"
  },
  "Introduction": {
    "title": "Hello world!",
    "description": "This is a simple example of a multilingual application using i18next."
  },
  "Lineage": {
    "sifuDennisLee": {
      "paragraph1": "The Dennis Lee Ving Tsun Academy in Singapore is proudly accredited by the Hong Kong SAR Government, dedicated to upholding the esteemed lineage of Grandmaster Ip Man. Our academy embraces a disciplined and methodical approach to Ving Tsun instruction, guided by a structured grading system. Each disciple is nurtured according to their unique progress and aptitude, ensuring a tailored path to mastery. Through careful assessment, those who attain the requisite standards are honored with certification, fostering a journey of learning and practice rooted in tradition and purpose.",
      "paragraph2": "Ving Tsun is a principle-driven Chinese martial art, blending steadfastness with adaptability and gentle power through relaxation. Anchored yet pliable, it absorbs or redirects external forces. As a method of self-defense, Ving Tsun employs both strikes and grapples, excelling in close-quarters combat with a focus on simultaneous offense and defense. It cultivates a deep awareness of bodily motion, drawing from muscles, core, tendons, and joints, and its forms greatly enhance proprioception. From a stable, grounded stance, all attacks and counterattacks are launched, believed to deliver greater impact when the practitioner is firmly rooted. This philosophy guides my path to mastery.",
      "paragraph3": "It is my honor to have studied as a disciple under Grandmaster Ip Ching, the second son of the revered Grandmaster Ip Man, during the 1990s. Through Grandmaster Ip Ching’s tireless dedication and selfless guidance, my understanding and mastery of Ving Tsun have deepened immeasurably. Coupled with my own diligent practice and study, this mentorship has enriched my knowledge and skill in this venerable martial art.",
      "paragraph4": "Inspired and guided by the wisdom of Grandmaster Ip Ching, I humbly accepted the role of Honorable Trainer at the Ving Tsun Ip Ching Athletic Association, under the auspices of the Auxiliary Medical Service, beginning in 2005. This esteemed position has been the foundation for my commitment to imparting the principles of Ving Tsun to the younger generation, fostering their growth in this revered martial art.",
      "paragraph5": "With the esteemed recognition of Grandmaster Ip Ching, I was privileged to contribute to the 2009 RTHK programme “Kung Fu Quest,” serving both as an actor and an advisor. Additionally, in Grandmaster Ip Ching’s classes, I had the honor of acting as a translator for international disciples, facilitating their learning. These invaluable experiences have profoundly enriched my understanding and proficiency in Ving Tsun. Through my steadfast dedication and deep reverence for this martial art, I was entrusted with the role of Director at both the Ving Tsun Athletic Association and the Ving Tsun Ip Ching Athletic Association since 2010, a responsibility I hold with great humility."
    },
    "sifuAndyChia": {
      "paragraph1": "Sifu Andy Chia is a dedicated instructor at the Dennis Lee Ving Tsun Academy in Singapore, where he has embraced the rich lineage of Ving Tsun martial arts under the guidance of his mentor, Sifu Dennis Lee. Trained in the disciplined and methodical approach championed by the academy, Sifu Andy has committed himself to mastering the art’s core principles of steadfastness, adaptability, and gentle power through relaxation. His journey reflects a deep respect for the tradition established by Grandmaster Ip Ching and Grandmaster Ip Man, as he diligently hones his skills in close-quarters combat, focusing on simultaneous offense and defense, and cultivating a heightened awareness of bodily motion and proprioception.",
      "paragraph2": "With a passion for sharing this venerable martial art, Sifu Andy plays an integral role in nurturing the next generation of practitioners at the academy. His teaching is informed by Sifu Dennis Lee’s structured grading system, ensuring each student’s unique progress is carefully guided toward mastery. Drawing inspiration from his mentor’s extensive experience and the philosophical roots of Ving Tsun, Sifu Andy strives to foster a learning environment that blends tradition with practical application, helping students build resilience and skill while honoring the art’s deep heritage.",
      "paragraph3": "Sifu Andy places a high emphasis on the importance of mastering the foundational forms of Ving Tsun, directness and simplicity over fancy techniques, and the significance of the horse stance in generating power. He believes that understanding the principles of Ving Tsun is essential for effective self-defense and personal growth. His teaching philosophy is rooted in the belief that Ving Tsun is not just a martial art but a way of life, promoting discipline, respect, and continuous self-improvement."
    },
    "tshirt": {
      "yellow": "The objective of the Siu Lim Tao Form is to develop the learners Kim Yong Ma horse stance which is very critical in Wing Chun, especially in the Ip Ching lineage. All hand movements are to be supported by the power generated from the horse stance. Basic punches and self defence movements will also be taught in this stage of training. Learners will also be able to perform single hand chisao and develop sensitivity to energy and understand body mechanics Learners will be presented with a certificate of proficiency at the end of this level before embarking onto the next level.",
      "green": "The objective of the Chum Kiu form is to enable the learner to manoeuvre their horse stance and be able to generate power within short distances. More Powerful punches and kicks will be introduced in this stage. Learners will also learn double hand Chisao and more hand movements. 1st 3 sections of the wooden dummy form will be taught to learners after proficiency of the above is attained. Learners will be presented with a certificate of proficiency at the end of this level before embarking onto the next level.",
      "blue": "This is the last free-hand form in the Wing Chum system. In ancient times, this form is only taught to closed-door disciples as this is a very powerful and deadly form. Learners who wish to learn this form will be required to abide by the code of conduct. Learners will be taught the art of darting fingers and the remaining sections of the wooden dummy form. Learners will be presented with a certificate of proficiency at the end of this level before embarking onto the next level.",
      "black": "Learner will be assessed by Sifu Dennis Lee personally to be a certified instructor. Learner must attain proficiency in the 3 forms, wooden dummy form and chisao."
    }
  }
}
